jokes_api/app/controllers/jokes_controller.rb

  def index
    @jokes = Joke.all
---
SELECT "jokes".* FROM "jokes"

  def create
    @joke = Joke.new(joke_params)

    if @joke.save
---
INSERT INTO "jokes" ("title", "author", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"