app/controllers/jokes_controller.rb

SELECT "jokes".* FROM "jokes"
---
  def index
    @jokes = Joke.all.reverse

INSERT INTO "jokes" ("title", "author", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @joke = Joke.new(joke_params)

    if @joke.save